DOCUMENTED_NOTES/multiwoz-reading.org
#+title: 阅读、理解、和解析MultiWoz数据集
#+OPTIONS: html-style:nil
#+date: Sun Jan  9 19:50:39 2022
#+author: Zi Liang
#+email: liangzid@stu.xjtu.edu.cn
#+latex_class: elegantpaper
#+filetags: ds:tod:dataset:data

this article last edited at <2022-01-10 Mon>

入门TOD（Task-oriented Dialogue Systems）的第一步是什么呢。是模型么，还是理解历史上经典的四个组件呢？

我觉得，还是数据。在我看来，理解任务型对话系统数据集的格式，是入门的第一步。所以很惭愧，我之前都没有入过门。今天趁着论文初稿完成，就整理一下。

* MultiWoz 1.0
首先来看一下数据集的结构文件：

#+BEGIN_SRC 
  ├── attraction_db.json
  ├── data.json
  ├── hotel_db.json
  ├── README.json
  ├── restaurant_db.json
  ├── testListFile.json
  ├── train_db.json
  └── valListFile.json
#+END_SRC

可以看出来上述排序是通过字母表排序的。所以还需要我们人工分类一下，主要包括三类：
1. 数据库部分（以db结尾），这类数据将一个数据表（所谓数据表就是一个数据的列表）以json的形式进行表达；
2. 核心数据文件，即data.json;
3. 测试集与验证集数据的列举文件，即ListFile结尾的文件。

   让我们一步步地去这三类数据是什么样子。

** Taxonomy of Database

   我们先来看看数据库的结构。我们知道，Woz系列的数据集，其场景类似于美团买东西的方式：即我想订一个旅馆（hotel）、车票（train）、餐馆（restaurant）、景点（attraction）等等。下面就以attraction为例，进行一个查看。

   attraction_db.json是一个数据表，里面就是一个列表，列表里的每一个元素都是诸如如下的格式：

   #+BEGIN_SRC emacs-lisp
     {
	 "address": "pool way, whitehill road, off newmarket road",
	 "area": "east",
	 "entrance fee": "?",
	 "id": "1",
	 "location": [
	     52.208789,
	     0.154883
	 ],
	 "name": "abbey pool and astroturf pitch",
	 "openhours": "?",
	 "phone": "01223902088",
	 "postcode": "cb58nt",
	 "pricerange": "?",
	 "type": "swimmingpool"
     },
   #+END_SRC

   可以发现，里面就是一些属性。对于那些缺省的属性，在value中被置为0.

  由此，其实可以把每一个domain的所有solt都归纳下来：

  |------------+---------------------------------------------------------------------------------------------------------|
  | domain     | slots                                                                                                   |
  | attraction | address,area,entrance fee,id,location,name,openhours,phone,postcode,pricerange,type                     |
  | train      | arriveBy,day,departure,destination,duration,leaveAt,price,trainID,                                      |
  | hotel      | address,area,internet,parking,id,location,name,phone,postcode,price,pricerange,stars,takesbookings,type |
  | restaurant | address,area,food,id,introduction,location,name,phone,postcode,pricerange,type                          |
  |------------+---------------------------------------------------------------------------------------------------------|

  后续可以发现，这些slot会起到很重要的作用。

  
