archives/multiwoz-reading.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-10-07 Sat 09:57 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>阅读、理解、和解析MultiWoz数据集</title>
<meta name="author" content="Zi Liang" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">阅读、理解、和解析MultiWoz数据集</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge0da4b3">1. MultiWoz 1.0</a>
<ul>
<li><a href="#org3937a08">1.1. Taxonomy of Database</a></li>
<li><a href="#orgf325c26">1.2. Taxonomy of data.</a></li>
<li><a href="#org2e79253">1.3. Taxonomy of val or test lists</a></li>
<li><a href="#orgef7dc97">1.4. 总结</a></li>
</ul>
</li>
<li><a href="#org4396489">2. MultiWoz 2.0</a>
<ul>
<li><a href="#org9d9cef7">2.1. taxonomy of ontology</a></li>
<li><a href="#org78298df">2.2. taxonomy of dialogue acts</a></li>
</ul>
</li>
<li><a href="#org56ece3d">3. MultiWoz 2.1</a>
<ul>
<li><a href="#orgf49c6e4">3.1. ontology更新了什么？</a></li>
<li><a href="#org15085cb">3.2. taxonomy of data.json</a></li>
<li><a href="#orge359cc5">3.3. slot_descriptions与tokenization</a></li>
</ul>
</li>
<li><a href="#org2577299">4. MultiWoz 2.2</a>
<ul>
<li><a href="#orgd862c99">4.1. schema：beyond ontology</a></li>
<li><a href="#org484bb92">4.2. 对话数据格式的改变</a></li>
</ul>
</li>
<li><a href="#orged9ff6f">5. 结论</a></li>
</ul>
</div>
</div>
<p>
this article last edited at <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-01-10 Mon&gt;</span></span>
</p>

<p>
入门TOD（Task-oriented Dialogue Systems）的第一步是什么呢。是模型么，还是理解历史上经典的四个组件呢？
</p>

<p>
我觉得，还是数据。在我看来，理解任务型对话系统数据集的格式，是入门的第一步。所以很惭愧，我之前都没有入过门。今天趁着论文初稿完成，就整理一下。
</p>

<div id="outline-container-orge0da4b3" class="outline-2">
<h2 id="orge0da4b3"><span class="section-number-2">1.</span> MultiWoz 1.0</h2>
<div class="outline-text-2" id="text-1">
<p>
首先来看一下数据集的结构文件：
</p>

<pre class="example">
├── attraction_db.json
├── data.json
├── hotel_db.json
├── README.json
├── restaurant_db.json
├── testListFile.json
├── train_db.json
└── valListFile.json
</pre>

<p>
可以看出来上述排序是通过字母表排序的。所以还需要我们人工分类一下，主要包括三类：
</p>
<ol class="org-ol">
<li>数据库部分（以db结尾），这类数据将一个数据表（所谓数据表就是一个数据的列表）以json的形式进行表达；</li>
<li>核心数据文件，即data.json;</li>
<li><p>
测试集与验证集数据的列举文件，即ListFile结尾的文件。
</p>

<p>
让我们一步步地去这三类数据是什么样子。
</p></li>
</ol>
</div>

<div id="outline-container-org3937a08" class="outline-3">
<h3 id="org3937a08"><span class="section-number-3">1.1.</span> Taxonomy of Database</h3>
<div class="outline-text-3" id="text-1-1">
<p>
我们先来看看数据库的结构。我们知道，Woz系列的数据集，其场景类似于美团买东西的方式：即我想订一个旅馆（hotel）、车票（train）、餐馆（restaurant）、景点（attraction）等等。下面就以attraction为例，进行一个查看。
</p>

<p>
attraction_db.json是一个数据表，里面就是一个列表，列表里的每一个元素都是诸如如下的格式：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">{
    <span style="color: #e361c3;">"address"</span>: <span style="color: #e361c3;">"pool way, whitehill road, off newmarket road"</span>,
    <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"east"</span>,
    <span style="color: #e361c3;">"entrance fee"</span>: <span style="color: #e361c3;">"?"</span>,
    <span style="color: #e361c3;">"id"</span>: <span style="color: #e361c3;">"1"</span>,
    <span style="color: #e361c3;">"location"</span>: <span style="color: #a0586c;">[</span>
        52.208789,
        0.154883
    <span style="color: #a0586c;">]</span><span style="color: #f3c91f;">,</span>
    <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"abbey pool and astroturf pitch"</span>,
    <span style="color: #e361c3;">"openhours"</span>: <span style="color: #e361c3;">"?"</span>,
    <span style="color: #e361c3;">"phone"</span>: <span style="color: #e361c3;">"01223902088"</span>,
    <span style="color: #e361c3;">"postcode"</span>: <span style="color: #e361c3;">"cb58nt"</span>,
    <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"?"</span>,
    <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"swimmingpool"</span>
},
</pre>
</div>

<p>
可以发现，里面就是一些属性。对于那些缺省的属性，在value中被置为0.
</p>

<p>
由此，其实可以把每一个domain的所有solt都归纳下来：
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">domain</td>
<td class="org-left">slots</td>
</tr>

<tr>
<td class="org-left">attraction</td>
<td class="org-left">address,area,entrance fee,id,location,name,openhours,phone,postcode,pricerange,type</td>
</tr>

<tr>
<td class="org-left">train</td>
<td class="org-left">arriveBy,day,departure,destination,duration,leaveAt,price,trainID,</td>
</tr>

<tr>
<td class="org-left">hotel</td>
<td class="org-left">address,area,internet,parking,id,location,name,phone,postcode,price,pricerange,stars,takesbookings,type</td>
</tr>

<tr>
<td class="org-left">restaurant</td>
<td class="org-left">address,area,food,id,introduction,location,name,phone,postcode,pricerange,type</td>
</tr>
</tbody>
</table>

<p>
后续可以发现，这些slot会起到很重要的作用。
</p>
</div>
</div>
