DOCUMENTED_NOTES/multiwoz-reading.org
** Taxonomy of data.

   首先来看一条(即表格中的一行)数据。

   #+BEGIN_SRC emacs-lisp
	 "SNG01856.json": {
	     "goal": {
		 "taxi": {}, 
		 "police": {}, 
		 "eod": true, 
		 "hospital": {}, 
		 "hotel": {
		     "info": {
			 "type": "hotel", 
			 "parking": "yes", 
			 "pricerange": "cheap", 
			 "internet": "yes"
		     }, 
		     "fail_info": {}, 
		     "book": {
			 "pre_invalid": true, 
			 "stay": "2", 
			 "day": "tuesday", 
			 "invalid": false, 
			 "people": "6"
		     }, 
		     "fail_book": {
			 "stay": "3"
		     }
		 }, 
		 "topic": {
		     "taxi": false, 
		     "police": false, 
		     "restaurant": false, 
		     "hospital": false, 
		     "hotel": false, 
		     "general": false, 
		     "attraction": false, 
		     "train": false, 
		     "booking": false
		 }, 
		 "attraction": {}, 
		 "train": {}, 
		 "messageLen": 6, 
		 "message": [
		     "You are looking for a <span class='emphasis'>place to stay</span>. The hotel should be in the <span class='emphasis'>cheap</span> price range and should be in the type of <span class='emphasis'>hotel</span>", 
		     "The hotel should <span class='emphasis'>include free parking</span> and should <span class='emphasis'>include free wifi</span>", 
		     "Once you find the <span class='emphasis'>hotel</span> you want to book it for <span class='emphasis'>6 people</span> and <span class='emphasis'>3 nights</span> starting from <span class='emphasis'>tuesday</span>", 
		     "If the booking fails how about <span class='emphasis'>2 nights</span>", 
		     "Make sure you get the <span class='emphasis'>reference number</span>"
		 ], 
		 "restaurant": {}
	     }, 
	     "log": [
		 {
		     "text": "am looking for a place to to stay that has cheap price range it should be in a type of hotel", 
		     "metadata": {}
		 }, 
		 {
		     "text": "Okay, do you have a specific area you want to stay in?", 
		     "metadata": {
			 "taxi": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "departure": "", 
				 "arriveBy": ""
			     }
			 }, 
			 "police": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {}
			 }, 
			 "restaurant": {
			     "book": {
				 "booked": [], 
				 "time": "", 
				 "day": "", 
				 "people": ""
			     }, 
			     "semi": {
				 "food": "", 
				 "pricerange": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "hospital": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "department": ""
			     }
			 }, 
			 "hotel": {
			     "book": {
				 "booked": [], 
				 "stay": "", 
				 "day": "", 
				 "people": ""
			     }, 
			     "semi": {
				 "name": "not mentioned", 
				 "area": "not mentioned", 
				 "parking": "not mentioned", 
				 "pricerange": "cheap", 
				 "stars": "not mentioned", 
				 "internet": "not mentioned", 
				 "type": "hotel"
			     }
			 }, 
			 "attraction": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "type": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "train": {
			     "book": {
				 "booked": [], 
				 "people": ""
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "day": "", 
				 "arriveBy": "", 
				 "departure": ""
			     }
			 }
		     }
		 }, 
		 {
		     "text": "no, i just need to make sure it's cheap. oh, and i need parking", 
		     "metadata": {}
		 }, 
		 {
		     "text": "I found 1 cheap hotel for you that includes parking. Do you like me to book it?", 
		     "metadata": {
			 "taxi": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "departure": "", 
				 "arriveBy": ""
			     }
			 }, 
			 "police": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {}
			 }, 
			 "restaurant": {
			     "book": {
				 "booked": [], 
				 "time": "", 
				 "day": "", 
				 "people": ""
			     }, 
			     "semi": {
				 "food": "", 
				 "pricerange": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "hospital": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "department": ""
			     }
			 }, 
			 "hotel": {
			     "book": {
				 "booked": [], 
				 "stay": "", 
				 "day": "", 
				 "people": ""
			     }, 
			     "semi": {
				 "name": "not mentioned", 
				 "area": "not mentioned", 
				 "parking": "yes", 
				 "pricerange": "cheap", 
				 "stars": "not mentioned", 
				 "internet": "not mentioned", 
				 "type": "hotel"
			     }
			 }, 
			 "attraction": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "type": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "train": {
			     "book": {
				 "booked": [], 
				 "people": ""
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "day": "", 
				 "arriveBy": "", 
				 "departure": ""
			     }
			 }
		     }
		 }, 
		 {
		     "text": "Yes, please. 6 people 3 nights starting on tuesday.", 
		     "metadata": {}
		 }, 
		 {
		     "text": "I am sorry but I wasn't able to book that for you for Tuesday. Is there another day you would like to stay or perhaps a shorter stay?", 
		     "metadata": {
			 "taxi": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "departure": "", 
				 "arriveBy": ""
			     }
			 }, 
			 "police": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {}
			 }, 
			 "restaurant": {
			     "book": {
				 "booked": [], 
				 "time": "", 
				 "day": "", 
				 "people": ""
			     }, 
			     "semi": {
				 "food": "", 
				 "pricerange": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "hospital": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "department": ""
			     }
			 }, 
			 "hotel": {
			     "book": {
				 "booked": [], 
				 "stay": "3", 
				 "day": "tuesday", 
				 "people": "6"
			     }, 
			     "semi": {
				 "name": "not mentioned", 
				 "area": "not mentioned", 
				 "parking": "yes", 
				 "pricerange": "cheap", 
				 "stars": "not mentioned", 
				 "internet": "not mentioned", 
				 "type": "hotel"
			     }
			 }, 
			 "attraction": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "type": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "train": {
			     "book": {
				 "booked": [], 
				 "people": ""
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "day": "", 
				 "arriveBy": "", 
				 "departure": ""
			     }
			 }
		     }
		 }, 
		 {
		     "text": "how about only 2 nights.", 
		     "metadata": {}
		 }, 
		 {
		     "text": "Booking was successful.\nReference number is : 7GAWK763. Anything else I can do for you?", 
		     "metadata": {
			 "taxi": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "departure": "", 
				 "arriveBy": ""
			     }
			 }, 
			 "police": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {}
			 }, 
			 "restaurant": {
			     "book": {
				 "booked": [], 
				 "time": "", 
				 "day": "", 
				 "people": ""
			     }, 
			     "semi": {
				 "food": "", 
				 "pricerange": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "hospital": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "department": ""
			     }
			 }, 
			 "hotel": {
			     "book": {
				 "booked": [
				     {
					 "name": "the cambridge belfry", 
					 "reference": "7GAWK763"
				     }
				 ], 
				 "stay": "2", 
				 "day": "tuesday", 
				 "people": "6"
			     }, 
			     "semi": {
				 "name": "not mentioned", 
				 "area": "not mentioned", 
				 "parking": "yes", 
				 "pricerange": "cheap", 
				 "stars": "not mentioned", 
				 "internet": "not mentioned", 
				 "type": "hotel"
			     }
			 }, 
			 "attraction": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "type": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "train": {
			     "book": {
				 "booked": [], 
				 "people": ""
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "day": "", 
				 "arriveBy": "", 
				 "departure": ""
			     }
			 }
		     }
		 }, 
		 {
		     "text": "No, that will be all. Good bye.", 
		     "metadata": {}
		 }, 
		 {
		     "text": "Thank you for using our services.", 
		     "metadata": {
			 "taxi": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "departure": "", 
				 "arriveBy": ""
			     }
			 }, 
			 "police": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {}
			 }, 
			 "restaurant": {
			     "book": {
				 "booked": [], 
				 "time": "", 
				 "day": "", 
				 "people": ""
			     }, 
			     "semi": {
				 "food": "", 
				 "pricerange": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "hospital": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "department": ""
			     }
			 }, 
			 "hotel": {
			     "book": {
				 "booked": [
				     {
					 "name": "the cambridge belfry", 
					 "reference": "7GAWK763"
				     }
				 ], 
				 "stay": "2", 
				 "day": "tuesday", 
				 "people": "6"
			     }, 
			     "semi": {
				 "name": "not mentioned", 
				 "area": "not mentioned", 
				 "parking": "yes", 
				 "pricerange": "cheap", 
				 "stars": "not mentioned", 
				 "internet": "not mentioned", 
				 "type": "hotel"
			     }
			 }, 
			 "attraction": {
			     "book": {
				 "booked": []
			     }, 
			     "semi": {
				 "type": "", 
				 "name": "", 
				 "area": ""
			     }
			 }, 
			 "train": {
			     "book": {
				 "booked": [], 
				 "people": ""
			     }, 
			     "semi": {
				 "leaveAt": "", 
				 "destination": "", 
				 "day": "", 
				 "arriveBy": "", 
				 "departure": ""
			     }
			 }
		     }
		 }
	     ]
	 }, 
   #+END_SRC

如上如图所示，这样的一条数据是略显复杂的，这也是TOD的数据标注为什么会复杂的原因。下面先看一下上述一条数据中涉及到哪些属性：

#+BEGIN_SRC python
  |--goal
      |--domain1
      |--domain2
      |--domainx
	  |--info
	  |--fail_info
	  |--book
	  |--fail_book
      |--topic
	  |--domainx: bool
      |--eod: bool
      |--messageLen: int
      |--message
	  |--message
  |--log[]
      |--text: str
      |--metadata[domains]
	  |--domain_i
	      |--book
		  |--booked
		  |--other slots
	      |--semi
#+END_SRC

上图较为经典的展现了一条数据的基本结构。我们可以发现，上述结构主要包含两部分：goal和log。前者主要是用在构建数据集上（MultiWoz是通过woz实验获得的），而后者，而是通过人工模拟而产生的数据。因此后者的结构更加重要一些。我们知道，text肯定就是对话的文本信息了，所以所谓的标签，就是这里的metadata。由于MultiWoz是多领域数据集，所以每个对话都可能会涉及到多个领域，这也就意味着，每句话都有可能涉及到多个领域。所以metadata里包含多个领域，同时，对每个领域，还包含了book和semi两部分。这两部分的具体含义是：

1. book：后面介绍
2. semi: 后面介绍



