archives/multiwoz-reading.html


<div id="outline-container-orgf325c26" class="outline-3">
<h3 id="orgf325c26"><span class="section-number-3">1.2.</span> Taxonomy of data.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
首先来看一条(即表格中的一行)数据。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e361c3;">"SNG01856.json"</span>: {
    <span style="color: #e361c3;">"goal"</span>: {
        <span style="color: #e361c3;">"taxi"</span>: {}, 
        <span style="color: #e361c3;">"police"</span>: {}, 
        <span style="color: #e361c3;">"eod"</span>: true, 
        <span style="color: #e361c3;">"hospital"</span>: {}, 
        <span style="color: #e361c3;">"hotel"</span>: {
            <span style="color: #e361c3;">"info"</span>: {
                <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>, 
                <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>, 
                <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>, 
                <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"yes"</span>
            }, 
            <span style="color: #e361c3;">"fail_info"</span>: {}, 
            <span style="color: #e361c3;">"book"</span>: {
                <span style="color: #e361c3;">"pre_invalid"</span>: true, 
                <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"2"</span>, 
                <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>, 
                <span style="color: #e361c3;">"invalid"</span>: false, 
                <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
            }, 
            <span style="color: #e361c3;">"fail_book"</span>: {
                <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"3"</span>
            }
        }, 
        <span style="color: #e361c3;">"topic"</span>: {
            <span style="color: #e361c3;">"taxi"</span>: false, 
            <span style="color: #e361c3;">"police"</span>: false, 
            <span style="color: #e361c3;">"restaurant"</span>: false, 
            <span style="color: #e361c3;">"hospital"</span>: false, 
            <span style="color: #e361c3;">"hotel"</span>: false, 
            <span style="color: #e361c3;">"general"</span>: false, 
            <span style="color: #e361c3;">"attraction"</span>: false, 
            <span style="color: #e361c3;">"train"</span>: false, 
            <span style="color: #e361c3;">"booking"</span>: false
        }, 
        <span style="color: #e361c3;">"attraction"</span>: {}, 
        <span style="color: #e361c3;">"train"</span>: {}, 
        <span style="color: #e361c3;">"messageLen"</span>: 6, 
        <span style="color: #e361c3;">"message"</span>: <span style="color: #a0586c;">[</span>
            <span style="color: #e361c3;">"You are looking for a &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;place to stay&lt;/span&gt;. The hotel should be in the &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;cheap&lt;/span&gt; price range and should be in the type of &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;hotel&lt;/span&gt;"</span>, 
            <span style="color: #e361c3;">"The hotel should &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;include free parking&lt;/span&gt; and should &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;include free wifi&lt;/span&gt;"</span>, 
            <span style="color: #e361c3;">"Once you find the &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;hotel&lt;/span&gt; you want to book it for &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;6 people&lt;/span&gt; and &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;3 nights&lt;/span&gt; starting from &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;tuesday&lt;/span&gt;"</span>, 
            <span style="color: #e361c3;">"If the booking fails how about &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;2 nights&lt;/span&gt;"</span>, 
            <span style="color: #e361c3;">"Make sure you get the &lt;span class='</span><span style="color: #738FD7;">emphasis</span><span style="color: #e361c3;">'&gt;reference number&lt;/span&gt;"</span>
        <span style="color: #a0586c;">]</span><span style="color: #f3c91f;">, </span>
        <span style="color: #e361c3;">"restaurant"</span>: {}
    }, 
    <span style="color: #e361c3;">"log"</span>: <span style="color: #a0586c;">[</span>
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"am looking for a place to to stay that has cheap price range it should be in a type of hotel"</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {}
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Okay, do you have a specific area you want to stay in?"</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {
                <span style="color: #e361c3;">"taxi"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"police"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {}
                }, 
                <span style="color: #e361c3;">"restaurant"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hospital"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hotel"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>, 
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    }
                }, 
                <span style="color: #e361c3;">"attraction"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"train"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    }
                }
            }
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"no, i just need to make sure it's cheap. oh, and i need parking"</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {}
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"I found 1 cheap hotel for you that includes parking. Do you like me to book it?"</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {
                <span style="color: #e361c3;">"taxi"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"police"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {}
                }, 
                <span style="color: #e361c3;">"restaurant"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hospital"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hotel"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>, 
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    }
                }, 
                <span style="color: #e361c3;">"attraction"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"train"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    }
                }
            }
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Yes, please. 6 people 3 nights starting on tuesday."</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {}
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"I am sorry but I wasn't able to book that for you for Tuesday. Is there another day you would like to stay or perhaps a shorter stay?"</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {
                <span style="color: #e361c3;">"taxi"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"police"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {}
                }, 
                <span style="color: #e361c3;">"restaurant"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hospital"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hotel"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"3"</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>, 
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    }
                }, 
                <span style="color: #e361c3;">"attraction"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"train"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    }
                }
            }
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"how about only 2 nights."</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {}
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Booking was successful.\nReference number is : 7GAWK763. Anything else I can do for you?"</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {
                <span style="color: #e361c3;">"taxi"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"police"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {}
                }, 
                <span style="color: #e361c3;">"restaurant"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hospital"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hotel"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[</span>
                            {
                                <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"the cambridge belfry"</span>, 
                                <span style="color: #e361c3;">"reference"</span>: <span style="color: #e361c3;">"7GAWK763"</span>
                            }
                        <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">, </span>
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"2"</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>, 
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    }
                }, 
                <span style="color: #e361c3;">"attraction"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"train"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    }
                }
            }
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"No, that will be all. Good bye."</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {}
        }, 
        {
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Thank you for using our services."</span>, 
            <span style="color: #e361c3;">"metadata"</span>: {
                <span style="color: #e361c3;">"taxi"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"police"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {}
                }, 
                <span style="color: #e361c3;">"restaurant"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hospital"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"hotel"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[</span>
                            {
                                <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"the cambridge belfry"</span>, 
                                <span style="color: #e361c3;">"reference"</span>: <span style="color: #e361c3;">"7GAWK763"</span>
                            }
                        <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">, </span>
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"2"</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>, 
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>, 
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>, 
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    }
                }, 
                <span style="color: #e361c3;">"attraction"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    }
                }, 
                <span style="color: #e361c3;">"train"</span>: {
                    <span style="color: #e361c3;">"book"</span>: {
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #9d81ba;">[]</span>, 
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    }, 
                    <span style="color: #e361c3;">"semi"</span>: {
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>, 
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    }
                }
            }
        }
    <span style="color: #a0586c;">]</span>
}, 
</pre>
</div>

<p>
如上如图所示，这样的一条数据是略显复杂的，这也是TOD的数据标注为什么会复杂的原因。下面先看一下上述一条数据中涉及到哪些属性：
</p>

<div class="org-src-container">
<pre class="src src-python">|--goal
    |--domain1
    |--domain2
    |--domainx
        |--info
        |--fail_info
        |--book
        |--fail_book
    |--topic
        |--domainx: <span style="color: #fbaed2;">bool</span>
    |--eod: <span style="color: #fbaed2;">bool</span>
    |--messageLen: <span style="color: #fbaed2;">int</span>
    |--message
        |--message
|--log<span style="color: #a0586c;">[]</span>
    |--text: <span style="color: #fbaed2;">str</span>
    |--metadata<span style="color: #a0586c;">[</span>domains<span style="color: #a0586c;">]</span>
        |--domain_i
            |--book
                |--booked
                |--other slots
            |--semi
</pre>
</div>

<p>
上图较为经典的展现了一条数据的基本结构。我们可以发现，上述结构主要包含两部分：goal和log。前者主要是用在构建数据集上（MultiWoz是通过woz实验获得的），而后者，而是通过人工模拟而产生的数据。因此后者的结构更加重要一些。我们知道，text肯定就是对话的文本信息了，所以所谓的标签，就是这里的metadata。由于MultiWoz是多领域数据集，所以每个对话都可能会涉及到多个领域，这也就意味着，每句话都有可能涉及到多个领域。所以metadata里包含多个领域，同时，对每个领域，还包含了book和semi两部分。这两部分的具体含义是：
</p>

<ol class="org-ol">
<li>book：后面介绍</li>
<li>semi: 后面介绍</li>
</ol>
</div>
</div>
