DOCUMENTED_NOTES/multiwoz-reading.org
** Taxonomy of val or test lists
   以上内容已经基本实现对数据集的管理了，最后的一个步骤是：如何区分训练集、测试集与验证集？所以文件夹中还有两个文件，用以进行数据集划分。每一个文件中都是包括一个id，也就是上面的一条data数据的key。


** 总结
   以上就是MultiWoz1.0的全貌。可惜这个数据集以前不叫MultiWoz，而是叫New Woz，所以真正意义上的MultiWoz指的实际上是2.0. 而2.0也是十分经典的一篇论文。下面来走进2.0的文件结构。

* MultiWoz 2.0
同上，先看一下文件结构：

#+BEGIN_SRC
  ├── attraction_db.json
  ├── data.json
  ├── dialogue_acts.json
  ├── hospital_db.json
  ├── hotel_db.json
  ├── ontology.json
  ├── police_db.json
  ├── README.json
  ├── restaurant_db.json
  ├── taxi_db.json
  ├── testListFile.json
  ├── train_db.json
  └── valListFile.json
#+END_SRC

发现变化了吗？
是的，从文件名上看，主要有以下几点变动：
1. 从db上看，多了两个领域（police和taxi）；
2. 多了一个ontology；
3. 多了一个dialogue_acts;

   笔者先验证了已有的几个部分（即data，ListFile和ontology）没有发生形式结构上的变动，然后准备就依照刚刚所发觉的这些变化，一一对变动进行介绍。

   
** taxonomy of ontology

   ontology是干什么的？这个富有哲学性的名词，其实第一次出现在计算机中，还是来自于AI的符号主义。ontology我理解主要是指一种抽象性的定义和限定，AI中常用的意义是一种庸俗化了的ontology。

   我之前写过一篇和知识图谱数据集相关的[[file:dataset_of_knowledge_graph.org][笔记]]。在那里你可以获得更加广阔的理解。{
本体是对实体的特点和行为的的抽象。（另一个定义：本体是对概念和关系的形式化表述）。同样用面向对象理解，class的定义就是对应object的本体。 }

   ontology.json文件中的内容，其实主要是对一些slot的规范。slot是什么？其实就是attribute name，如时间、地点、价格等等。那么怎么规范slot呢？传统的数据库会有一些基本类型，这些基本的数据类型（如string、int）就约束了slot。在这里，ontology只限定枚举变量。比如range这个slot，我们得知道range这个slot的value都是什么，枚举变量则是给了一个集合，表明所有的value都必定地属于这个集合。

   下面是ontology.json中的几个元素的示例：


   #+BEGIN_SRC emacs-lisp

     {
	 "hotel-price range": [
	     "cheap",
	     "do n't care",
	     "moderate",
	     "expensive"
	 ],
	 "hotel-internet": [
	     "yes",
	     "do n't care",
	     "no"
	 ],
	 ...
	 "taxi-arrive by": [
	     "19:15",
	     "15:45",
	     "17:15",
	     ...
	     "17:30",
	     "17:00",
     }

   #+END_SRC

发现了吗，这里每个元素的key是domain和slot的组合，然后value就是我们所说的集合（json中表达序列只能通过列表）。我们还可以发现，这里的slot虽然存在和db文件中的对应关系，但是他们并不是完全相同（将匈牙利标记转化成自然语言标记了）。


