DOCUMENTED_NOTES/multiwoz-reading.org
** taxonomy of dialogue acts

   下面再来看另外一个文件，有关于对话系统的对话动作。

   什么是对话动作？一句非结构化的自然语言语句，它的结构化表达，就是对话动作。比如“地址在哪里啊？”这句话，其实就包含询问-地址这样的一个结构化信息。我们可以通过dialogue_acts.json来详细了解对应的结构化信息。



   #+BEGIN_SRC js
	 "PMUL3994": {
	     "1": {
		 "Attraction-Request": [
		     [
			 "Area",
			 "?"
		     ]
		 ],
		 "Attraction-Inform": [
		     [
			 "Area",
			 "Cambridge"
		     ],
		     [
			 "Type",
			 "swimming pools"
		     ],
		     [
			 "Choice",
			 "four "
		     ]
		 ]
	     },
	     "6": {
		 "Booking-Request": [
		     [
			 "Time",
			 "?"
		     ]
		 ]
	     },
	     "9": {
		 "general-reqmore": [
		     [
			 "none",
			 "none"
		     ]
		 ]
	     },
	     "5": {
		 "Booking-Request": [
		     [
			 "Day",
			 "?"
		     ]
		 ]
	     },
	     "4": {
		 "Booking-Inform": [
		     [
			 "none",
			 "none"
		     ]
		 ]
	     },
	     "7": {
		 "Taxi-Request": [
		     [
			 "Dest",
			 "?"
		     ]
		 ],
		 "Booking-Book": [
		     [
			 "Ref",
			 "U9WFNBHE"
		     ]
		 ]
	     },
	     "2": {
		 "Attraction-Recommend": [
		     [
			 "Post",
			 "cb43px"
		     ],
		     [
			 "Name",
			 "Jesus green outdoor pool"
		     ]
		 ],
		 "general-reqmore": [
		     [
			 "none",
			 "none"
		     ]
		 ]
	     },
	     "8": {
		 "Taxi-Inform": [
		     [
			 "Phone",
			 "07225283033"
		     ],
		     [
			 "Car",
			 "white Toyota"
		     ]
		 ],
		 "general-reqmore": [
		     [
			 "none",
			 "none"
		     ]
		 ]
	     },
	     "3": {
		 "Booking-Inform": [
		     [
			 "none",
			 "none"
		     ]
		 ],
		 "Restaurant-Recommend": [
		     [
			 "Area",
			 "center "
		     ],
		     [
			 "Price",
			 "expensive "
		     ],
		     [
			 "Name",
			 "little seoul"
		     ]
		 ]
	     }
	 },
   #+END_SRC

上面是一个例子，对应着一个对话。我们透过上面这个例子可以看出，其结构如下：

#+BEGIN_SRC
|--dialouge id
    |--序号i
        |-- domain-intent combination 1
        |-- domain-intent combination 2
        |-- domain-intent combination x
            |--list i
                |--slot
                |--value
        |-- domain-intent combination n
#+END_SRC

通过以上结构我们可以发现，每一个对话下面都有从1到N的一堆序号，这里每一个序号对应的是data.json中这个对话的第i个text，而对于每一个text，都会拥有一个对话动作列表。在这个列表中，每一个元素都是一个字典，key是domain和intent的组合，value又是一个列表，代表对于这个领域进行这个动作所包括的所有信息pair，其中列表的每一个元素，都是一个二元组，即slot和value。当表达一些类似于询问的意图是，value自然是不存在 ，所以此处被处理为问号。而正如序号3和序号8所示，如果这个intent 对 slot和value都不对应，那么便会传一个none字符串进去。

下面是官方说法：

#+begin_quote
  There are 6 domains ('Booking', 'Restaurant', 'Hotel', 'Attraction', 'Taxi', 'Train') and 1 dummy domain ('general').

  A domain-dependent dialogue act is defined as a domain token followed by a domain-independent dialogue act, e.g. 'Hotel-inform' means it is a 'inform' act in Hotel domain.
  
  Dialogue acts which cannot take slots, e.g., 'good bye', are defined under 'general' domain.

  A slot-value pair defined as a list with two elements. The first element is slot token and the second one is its value.

  If a dialogue act takes no slots, e.g., dialogue act 'offer booking' for an utterance 'would you like to take a reservation?', its slot-value pair is ['none', 'none']

  There are four types of value:

  1) If a slot takes binary value, e.g., 'has Internet' or 'has park', the value is either 'yes' or 'no'.
  2) If a slot is under the act 'request', e.g., 'request' about 'area', the value is express as '?'.
  3) The value that appears in the utterancem e,g., the name of a restaurant.
  4) If for some reasons the turn does not have annotation then it is labeled as "No Annotation".
#+end_quote
  
我学会了吗？

* MultiWoz 2.1
 如果你觉得MultiWoz数据集就这点程度，或者说：如果你以为这样就可以使用multiwoz数据集，那么，你就走了一些弯路。因为在2022年的一开始，不得不说，MultiWoz2.1已经可以算是发论文的最低要求了。下面就让我们来看一下，这一版数据集，又搞出来什么新花样吧。

 #+BEGIN_SRC 
   .
   ├── attraction_db.json
   ├── data.json
   ├── hospital_db.json
   ├── hotel_db.json
   ├── ontology.json
   ├── police_db.json
   ├── README
   ├── restaurant_db.json
   ├── slot_descriptions.json
   ├── system_acts.json
   ├── taxi_db.json
   ├── testListFile.txt
   ├── tokenization.md
   ├── train_db.json
   └── valListFile.txt
 #+END_SRC

经过阅读可以发现： 和过去一样，数据库相关文件都没有发生变换，但无论是data.json，还是ontology，都发生了一些变化。
这些变化所产生的重要原因是：换了一个作者……但是新的文件格式，不得不说，反而有利于我们进一步地去使用MultiWoz数据集。下面就带着这些变化，与MultiWoz2.1全新添加的东西，一起对MultiWoz2.1进行讨论。

