archives/multiwoz-reading.html


<div id="outline-container-org78298df" class="outline-3">
<h3 id="org78298df"><span class="section-number-3">2.2.</span> taxonomy of dialogue acts</h3>
<div class="outline-text-3" id="text-2-2">
<p>
下面再来看另外一个文件，有关于对话系统的对话动作。
</p>

<p>
什么是对话动作？一句非结构化的自然语言语句，它的结构化表达，就是对话动作。比如“地址在哪里啊？”这句话，其实就包含询问-地址这样的一个结构化信息。我们可以通过dialogue_acts.json来详细了解对应的结构化信息。
</p>



<div class="org-src-container">
<pre class="src src-js"><span style="color: #e361c3;">"PMUL3994"</span>: <span style="color: #a0586c;">{</span>
    <span style="color: #e361c3;">"1"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Attraction-Request"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Area"</span>,
                <span style="color: #e361c3;">"?"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>,
        <span style="color: #e361c3;">"Attraction-Inform"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Area"</span>,
                <span style="color: #e361c3;">"Cambridge"</span>
            <span style="color: #C68EDE;">]</span>,
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Type"</span>,
                <span style="color: #e361c3;">"swimming pools"</span>
            <span style="color: #C68EDE;">]</span>,
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Choice"</span>,
                <span style="color: #e361c3;">"four "</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"6"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Booking-Request"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Time"</span>,
                <span style="color: #e361c3;">"?"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"9"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"general-reqmore"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"none"</span>,
                <span style="color: #e361c3;">"none"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"5"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Booking-Request"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Day"</span>,
                <span style="color: #e361c3;">"?"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"4"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Booking-Inform"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"none"</span>,
                <span style="color: #e361c3;">"none"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"7"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Taxi-Request"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Dest"</span>,
                <span style="color: #e361c3;">"?"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>,
        <span style="color: #e361c3;">"Booking-Book"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Ref"</span>,
                <span style="color: #e361c3;">"U9WFNBHE"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"2"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Attraction-Recommend"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Post"</span>,
                <span style="color: #e361c3;">"cb43px"</span>
            <span style="color: #C68EDE;">]</span>,
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Name"</span>,
                <span style="color: #e361c3;">"Jesus green outdoor pool"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>,
        <span style="color: #e361c3;">"general-reqmore"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"none"</span>,
                <span style="color: #e361c3;">"none"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"8"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Taxi-Inform"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Phone"</span>,
                <span style="color: #e361c3;">"07225283033"</span>
            <span style="color: #C68EDE;">]</span>,
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Car"</span>,
                <span style="color: #e361c3;">"white Toyota"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>,
        <span style="color: #e361c3;">"general-reqmore"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"none"</span>,
                <span style="color: #e361c3;">"none"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"3"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"Booking-Inform"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"none"</span>,
                <span style="color: #e361c3;">"none"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>,
        <span style="color: #e361c3;">"Restaurant-Recommend"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Area"</span>,
                <span style="color: #e361c3;">"center "</span>
            <span style="color: #C68EDE;">]</span>,
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Price"</span>,
                <span style="color: #e361c3;">"expensive "</span>
            <span style="color: #C68EDE;">]</span>,
            <span style="color: #C68EDE;">[</span>
                <span style="color: #e361c3;">"Name"</span>,
                <span style="color: #e361c3;">"little seoul"</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">]</span>
    <span style="color: #9d81ba;">}</span>
<span style="color: #a0586c;">}</span>,
</pre>
</div>

<p>
上面是一个例子，对应着一个对话。我们透过上面这个例子可以看出，其结构如下：
</p>

<pre class="example">
|--dialouge id
    |--序号i
	|-- domain-intent combination 1
	|-- domain-intent combination 2
	|-- domain-intent combination x
	    |--list i
		|--slot
		|--value
	|-- domain-intent combination n
</pre>

<p>
通过以上结构我们可以发现，每一个对话下面都有从1到N的一堆序号，这里每一个序号对应的是data.json中这个对话的第i个text，而对于每一个text，都会拥有一个对话动作列表。在这个列表中，每一个元素都是一个字典，key是domain和intent的组合，value又是一个列表，代表对于这个领域进行这个动作所包括的所有信息pair，其中列表的每一个元素，都是一个二元组，即slot和value。当表达一些类似于询问的意图是，value自然是不存在 ，所以此处被处理为问号。而正如序号3和序号8所示，如果这个intent 对 slot和value都不对应，那么便会传一个none字符串进去。
</p>

<p>
下面是官方说法：
</p>

<blockquote>
<p>
There are 6 domains ('Booking', 'Restaurant', 'Hotel', 'Attraction', 'Taxi', 'Train') and 1 dummy domain ('general').
</p>

<p>
A domain-dependent dialogue act is defined as a domain token followed by a domain-independent dialogue act, e.g. 'Hotel-inform' means it is a 'inform' act in Hotel domain.
</p>

<p>
Dialogue acts which cannot take slots, e.g., 'good bye', are defined under 'general' domain.
</p>

<p>
A slot-value pair defined as a list with two elements. The first element is slot token and the second one is its value.
</p>

<p>
If a dialogue act takes no slots, e.g., dialogue act 'offer booking' for an utterance 'would you like to take a reservation?', its slot-value pair is ['none', 'none']
</p>

<p>
There are four types of value:
</p>

<ol class="org-ol">
<li>If a slot takes binary value, e.g., 'has Internet' or 'has park', the value is either 'yes' or 'no'.</li>
<li>If a slot is under the act 'request', e.g., 'request' about 'area', the value is express as '?'.</li>
<li>The value that appears in the utterancem e,g., the name of a restaurant.</li>
<li>If for some reasons the turn does not have annotation then it is labeled as "No Annotation".</li>
</ol>
</blockquote>

<p>
我学会了吗？
</p>
</div>
</div>
</div>

<div id="outline-container-org56ece3d" class="outline-2">
<h2 id="org56ece3d"><span class="section-number-2">3.</span> MultiWoz 2.1</h2>
<div class="outline-text-2" id="text-3">
<p>
如果你觉得MultiWoz数据集就这点程度，或者说：如果你以为这样就可以使用multiwoz数据集，那么，你就走了一些弯路。因为在2022年的一开始，不得不说，MultiWoz2.1已经可以算是发论文的最低要求了。下面就让我们来看一下，这一版数据集，又搞出来什么新花样吧。
</p>

<pre class="example">
.
├── attraction_db.json
├── data.json
├── hospital_db.json
├── hotel_db.json
├── ontology.json
├── police_db.json
├── README
├── restaurant_db.json
├── slot_descriptions.json
├── system_acts.json
├── taxi_db.json
├── testListFile.txt
├── tokenization.md
├── train_db.json
└── valListFile.txt
</pre>

<p>
经过阅读可以发现： 和过去一样，数据库相关文件都没有发生变换，但无论是data.json，还是ontology，都发生了一些变化。
这些变化所产生的重要原因是：换了一个作者……但是新的文件格式，不得不说，反而有利于我们进一步地去使用MultiWoz数据集。下面就带着这些变化，与MultiWoz2.1全新添加的东西，一起对MultiWoz2.1进行讨论。
</p>
</div>
