DOCUMENTED_NOTES/multiwoz-reading.org
** ontology更新了什么？

先来看几个示例：


#+BEGIN_SRC emacs-lisp
    "hotel-semi-pricerange": [
      "expensive",
      "cheap",
      "moderate",
      "cheap>moderate",
      "dontcare",
      "cheap|moderate",
      "moderate|cheap",
      "$100"
    ],

    "taxi-semi-arriveBy": [
      "12:00",
      "19:30",
      ...,
    ],

    "hotel-book-people": [
      "2",
      "7",
      "8",
      "5",
      "1",
      "6",
      "3",
      "4"
    ],
#+END_SRC

发现了没有？ontology由 domain-intent的旧格式，更新为了 domain-XX-slot的新格式，此处的XX是semi或者book，也就是之前介绍data.json结构时所揭示的那个样子。

除此之外，ontology的另一点改进是，此处的slot终于可以和db里的结果一一对应了，这样就解决了之前所面临的有关于转化的一些问题。

