archives/multiwoz-reading.html

<div id="outline-container-orgf49c6e4" class="outline-3">
<h3 id="orgf49c6e4"><span class="section-number-3">3.1.</span> ontology更新了什么？</h3>
<div class="outline-text-3" id="text-3-1">
<p>
先来看几个示例：
</p>


<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #e361c3;">"hotel-semi-pricerange"</span>: <span style="color: #a0586c;">[</span>
  <span style="color: #e361c3;">"expensive"</span>,
  <span style="color: #e361c3;">"cheap"</span>,
  <span style="color: #e361c3;">"moderate"</span>,
  <span style="color: #e361c3;">"cheap&gt;moderate"</span>,
  <span style="color: #e361c3;">"dontcare"</span>,
  <span style="color: #e361c3;">"cheap|moderate"</span>,
  <span style="color: #e361c3;">"moderate|cheap"</span>,
  <span style="color: #e361c3;">"$100"</span>
<span style="color: #a0586c;">]</span><span style="color: #f3c91f;">,</span>

<span style="color: #e361c3;">"taxi-semi-arriveBy"</span>: <span style="color: #a0586c;">[</span>
  <span style="color: #e361c3;">"12:00"</span>,
  <span style="color: #e361c3;">"19:30"</span>,
  ...,
<span style="color: #a0586c;">]</span><span style="color: #f3c91f;">,</span>

<span style="color: #e361c3;">"hotel-book-people"</span>: <span style="color: #a0586c;">[</span>
  <span style="color: #e361c3;">"2"</span>,
  <span style="color: #e361c3;">"7"</span>,
  <span style="color: #e361c3;">"8"</span>,
  <span style="color: #e361c3;">"5"</span>,
  <span style="color: #e361c3;">"1"</span>,
  <span style="color: #e361c3;">"6"</span>,
  <span style="color: #e361c3;">"3"</span>,
  <span style="color: #e361c3;">"4"</span>
<span style="color: #a0586c;">]</span><span style="color: #f3c91f;">,</span>
</pre>
</div>

<p>
发现了没有？ontology由 domain-intent的旧格式，更新为了 domain-XX-slot的新格式，此处的XX是semi或者book，也就是之前介绍data.json结构时所揭示的那个样子。
</p>

<p>
除此之外，ontology的另一点改进是，此处的slot终于可以和db里的结果一一对应了，这样就解决了之前所面临的有关于转化的一些问题。
</p>
</div>
</div>
