archives/multiwoz-reading.html

<div id="outline-container-org15085cb" class="outline-3">
<h3 id="org15085cb"><span class="section-number-3">3.2.</span> taxonomy of data.json</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #e361c3;">"SNG01856.json"</span>: <span style="color: #a0586c;">{</span>
    <span style="color: #e361c3;">"goal"</span>: <span style="color: #9d81ba;">{</span>
        <span style="color: #e361c3;">"taxi"</span>: <span style="color: #9587DD;">{}</span>,
        <span style="color: #e361c3;">"police"</span>: <span style="color: #9587DD;">{}</span>,
        <span style="color: #e361c3;">"hospital"</span>: <span style="color: #9587DD;">{}</span>,
        <span style="color: #e361c3;">"hotel"</span>: <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"info"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>,
                <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>,
                <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>,
                <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"yes"</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"fail_info"</span>: <span style="color: #C68EDE;">{}</span>,
            <span style="color: #e361c3;">"book"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"pre_invalid"</span>: <span style="color: #738FD7;">true</span>,
                <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"2"</span>,
                <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>,
                <span style="color: #e361c3;">"invalid"</span>: <span style="color: #738FD7;">false</span>,
                <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"fail_book"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"3"</span>
            <span style="color: #C68EDE;">}</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #e361c3;">"topic"</span>: <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"taxi"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"police"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"restaurant"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"hospital"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"hotel"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"general"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"attraction"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"train"</span>: <span style="color: #738FD7;">false</span>,
            <span style="color: #e361c3;">"booking"</span>: <span style="color: #738FD7;">false</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #e361c3;">"attraction"</span>: <span style="color: #9587DD;">{}</span>,
        <span style="color: #e361c3;">"train"</span>: <span style="color: #9587DD;">{}</span>,
        <span style="color: #e361c3;">"message"</span>: <span style="color: #9587DD;">[</span>
            <span style="color: #e361c3;">"You are looking for a &lt;span class='emphasis'&gt;place to stay&lt;/span&gt;. The hotel should be in the &lt;span class='emphasis'&gt;cheap&lt;/span&gt; price range and should be in the type of &lt;span class='emphasis'&gt;hotel&lt;/span&gt;"</span>,
            <span style="color: #e361c3;">"The hotel should &lt;span class='emphasis'&gt;include free parking&lt;/span&gt; and should &lt;span class='emphasis'&gt;include free wifi&lt;/span&gt;"</span>,
            <span style="color: #e361c3;">"Once you find the &lt;span class='emphasis'&gt;hotel&lt;/span&gt; you want to book it for &lt;span class='emphasis'&gt;6 people&lt;/span&gt; and &lt;span class='emphasis'&gt;3 nights&lt;/span&gt; starting from &lt;span class='emphasis'&gt;tuesday&lt;/span&gt;"</span>,
            <span style="color: #e361c3;">"If the booking fails how about &lt;span class='emphasis'&gt;2 nights&lt;/span&gt;"</span>,
            <span style="color: #e361c3;">"Make sure you get the &lt;span class='emphasis'&gt;reference number&lt;/span&gt;"</span>
        <span style="color: #9587DD;">]</span>,
        <span style="color: #e361c3;">"restaurant"</span>: <span style="color: #9587DD;">{}</span>
    <span style="color: #9d81ba;">}</span>,
    <span style="color: #e361c3;">"log"</span>: <span style="color: #9d81ba;">[</span>
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"am looking for a place to to stay that has cheap price range it should be in a type of hotel"</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"Hotel-Inform"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Type"</span>,
                        <span style="color: #e361c3;">"hotel"</span>
                    <span style="color: #738FD7;">]</span>,
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Price"</span>,
                        <span style="color: #e361c3;">"cheap"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[</span>
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"Type"</span>,
                    <span style="color: #e361c3;">"hotel"</span>,
                    20,
                    20
                <span style="color: #80bcb6;">]</span>,
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"Price"</span>,
                    <span style="color: #e361c3;">"cheap"</span>,
                    10,
                    10
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Okay, do you have a specific area you want to stay in?"</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"taxi"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"police"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"restaurant"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hospital"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hotel"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>,
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"attraction"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"train"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"Hotel-Request"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Area"</span>,
                        <span style="color: #e361c3;">"?"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"no, i just need to make sure it's cheap. oh, and i need parking"</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"Hotel-Inform"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Parking"</span>,
                        <span style="color: #e361c3;">"yes"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"I found 1 cheap hotel for you that includes parking. Do you like me to book it?"</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"taxi"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"police"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"restaurant"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hospital"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hotel"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>,
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"attraction"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"train"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"Booking-Inform"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"none"</span>,
                        <span style="color: #e361c3;">"none"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>,
                <span style="color: #e361c3;">"Hotel-Inform"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Price"</span>,
                        <span style="color: #e361c3;">"cheap"</span>
                    <span style="color: #738FD7;">]</span>,
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Choice"</span>,
                        <span style="color: #e361c3;">"1"</span>
                    <span style="color: #738FD7;">]</span>,
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Parking"</span>,
                        <span style="color: #e361c3;">"none"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[</span>
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"Price"</span>,
                    <span style="color: #e361c3;">"cheap"</span>,
                    3,
                    3
                <span style="color: #80bcb6;">]</span>,
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"Choice"</span>,
                    <span style="color: #e361c3;">"1"</span>,
                    2,
                    2
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Yes, please. 6 people 3 nights starting on tuesday."</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"Hotel-Inform"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Stay"</span>,
                        <span style="color: #e361c3;">"3"</span>
                    <span style="color: #738FD7;">]</span>,
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Day"</span>,
                        <span style="color: #e361c3;">"tuesday"</span>
                    <span style="color: #738FD7;">]</span>,
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"People"</span>,
                        <span style="color: #e361c3;">"6"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[</span>
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"Stay"</span>,
                    <span style="color: #e361c3;">"3"</span>,
                    6,
                    6
                <span style="color: #80bcb6;">]</span>,
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"Day"</span>,
                    <span style="color: #e361c3;">"tuesday"</span>,
                    10,
                    10
                <span style="color: #80bcb6;">]</span>,
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"People"</span>,
                    <span style="color: #e361c3;">"6"</span>,
                    4,
                    4
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"I am sorry but I wasn't able to book that for you for Tuesday. Is there another day you would like to stay or perhaps a shorter stay?"</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"taxi"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"police"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"restaurant"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hospital"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hotel"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"3"</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>,
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"attraction"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"train"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"Booking-NoBook"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Day"</span>,
                        <span style="color: #e361c3;">"Tuesday"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>,
                <span style="color: #e361c3;">"Booking-Request"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Stay"</span>,
                        <span style="color: #e361c3;">"?"</span>
                    <span style="color: #738FD7;">]</span>,
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Day"</span>,
                        <span style="color: #e361c3;">"?"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[</span>
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Booking-NoBook"</span>,
                    <span style="color: #e361c3;">"Day"</span>,
                    <span style="color: #e361c3;">"Tuesday"</span>,
                    14,
                    14
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"how about only 2 nights."</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"Hotel-Inform"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Stay"</span>,
                        <span style="color: #e361c3;">"2"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[</span>
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Hotel-Inform"</span>,
                    <span style="color: #e361c3;">"Stay"</span>,
                    <span style="color: #e361c3;">"2"</span>,
                    3,
                    3
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Booking was successful.\nReference number is : 7GAWK763. Anything else I can do for you?"</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"taxi"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"police"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"restaurant"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hospital"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hotel"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[</span>
                            <span style="color: #53859d;">{</span>
                                <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"the cambridge belfry"</span>,
                                <span style="color: #e361c3;">"reference"</span>: <span style="color: #e361c3;">"7GAWK763"</span>
                            <span style="color: #53859d;">}</span>
                        <span style="color: #4d9391;">]</span>,
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"2"</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>,
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"attraction"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"train"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"general-reqmore"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"none"</span>,
                        <span style="color: #e361c3;">"none"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>,
                <span style="color: #e361c3;">"Booking-Book"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"Ref"</span>,
                        <span style="color: #e361c3;">"7GAWK763"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[</span>
                <span style="color: #80bcb6;">[</span>
                    <span style="color: #e361c3;">"Booking-Book"</span>,
                    <span style="color: #e361c3;">"Ref"</span>,
                    <span style="color: #e361c3;">"7GAWK763"</span>,
                    8,
                    8
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"No, that will be all. Good bye."</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"general-bye"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"none"</span>,
                        <span style="color: #e361c3;">"none"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[]</span>
        <span style="color: #9587DD;">}</span>,
        <span style="color: #9587DD;">{</span>
            <span style="color: #e361c3;">"text"</span>: <span style="color: #e361c3;">"Thank you for using our services."</span>,
            <span style="color: #e361c3;">"metadata"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"taxi"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"police"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"restaurant"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"time"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"food"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hospital"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"department"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"hotel"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[</span>
                            <span style="color: #53859d;">{</span>
                                <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"the cambridge belfry"</span>,
                                <span style="color: #e361c3;">"reference"</span>: <span style="color: #e361c3;">"7GAWK763"</span>
                            <span style="color: #53859d;">}</span>
                        <span style="color: #4d9391;">]</span>,
                        <span style="color: #e361c3;">"stay"</span>: <span style="color: #e361c3;">"2"</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">"tuesday"</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">"6"</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"parking"</span>: <span style="color: #e361c3;">"yes"</span>,
                        <span style="color: #e361c3;">"pricerange"</span>: <span style="color: #e361c3;">"cheap"</span>,
                        <span style="color: #e361c3;">"stars"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"internet"</span>: <span style="color: #e361c3;">"not mentioned"</span>,
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">"hotel"</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"attraction"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"type"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"area"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>,
                <span style="color: #e361c3;">"train"</span>: <span style="color: #80bcb6;">{</span>
                    <span style="color: #e361c3;">"book"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"booked"</span>: <span style="color: #4d9391;">[]</span>,
                        <span style="color: #e361c3;">"people"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>,
                    <span style="color: #e361c3;">"semi"</span>: <span style="color: #738FD7;">{</span>
                        <span style="color: #e361c3;">"leaveAt"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"destination"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"day"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"arriveBy"</span>: <span style="color: #e361c3;">""</span>,
                        <span style="color: #e361c3;">"departure"</span>: <span style="color: #e361c3;">""</span>
                    <span style="color: #738FD7;">}</span>
                <span style="color: #80bcb6;">}</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"dialog_act"</span>: <span style="color: #C68EDE;">{</span>
                <span style="color: #e361c3;">"general-bye"</span>: <span style="color: #80bcb6;">[</span>
                    <span style="color: #738FD7;">[</span>
                        <span style="color: #e361c3;">"none"</span>,
                        <span style="color: #e361c3;">"none"</span>
                    <span style="color: #738FD7;">]</span>
                <span style="color: #80bcb6;">]</span>
            <span style="color: #C68EDE;">}</span>,
            <span style="color: #e361c3;">"span_info"</span>: <span style="color: #C68EDE;">[]</span>
        <span style="color: #9587DD;">}</span>
    <span style="color: #9d81ba;">]</span>
<span style="color: #a0586c;">}</span>,
</pre>
</div>

<p>
和往常一样，上述数据的结构可以总结如下：
</p>

<div class="org-src-container">
<pre class="src src-python">|--goal
    |--domain1
    |--domain2
    |--domainx
        |--info
        |--fail_info
        |--book
        |--fail_book
    |--topic
        |--domainx: <span style="color: #fbaed2;">bool</span>
    |--eod: <span style="color: #fbaed2;">bool</span>
    <span style="color: #7A6884;"># </span><span style="color: #7A6884; font-style: italic;">|--messageLen: int</span>
    |--message
        |--message i
|--log<span style="color: #a0586c;">[]</span>
    |--text: <span style="color: #fbaed2;">str</span>
    |--metadata<span style="color: #a0586c;">[</span>domains<span style="color: #a0586c;">]</span>
        |--domain_i
            |--book
                |--booked
                |--other slots
            |--semi
    |--dialog_act
        |-- this <span style="color: #C68EDE;">is</span> the <span style="color: #fbaed2;">format</span> of dialog acts <span style="color: #C68EDE;">in</span> MultiWoz 2.0
    |--span_info
        |--dialogue act 1
        |--dialogue act 2
        |--dialogue act i
             |--domain-intent
             |--slot
             |--value
             |--value position span beginning <span style="color: #7A6884;"># </span><span style="color: #7A6884; font-style: italic;">span&#30340;&#35745;&#31639;&#20174;&#38646;&#24320;&#22987;</span>
             |--value positiion span ending
</pre>
</div>

<p>
啊，原来是把对话动作直接添加进去了，顺便为了方便NER类似的token级别的操作，还把span的位置信息也添加上了。
</p>

<p>
其实事情没有这么简单，就连每个对话的名字也被进行了处理。比如上述示例的这个对话，由于整个对话只涉及到一个领域，所以此处的名字中包含了SNG（即single domain），而对于一个对话中包含多个领域的情况，对话名字种会有MUL。
</p>
</div>
</div>
