DOCUMENTED_NOTES/multiwoz-reading.org
** slot_descriptions与tokenization

这个数据集的另外一个特色是，除了上面的种种改动之外，MultiWoz2.1还添加了两个描述文件。

1. slot_descriptions.json 这个文件的用途和文件名一样，就是为了解释每一个slot是干什么用的。我怀疑这个文件可能是为了给当时的标注人员使用而创建
2. tokenization.md 这个文件主要是为了解决span_info中slot位置不准确的问题。我不是特别懂，总之，如果你想和DStC8的实验保持一致，那么你应该先保持先做一些变换，来尽可能地减小差距。代码如下：


#+BEGIN_SRC python
  text = re.sub("/", " / ", text)
  text = re.sub("\-", " \- ", text)
  text = re.sub("Im", "I\'m", text)
  text = re.sub("im", "i\'m", text)
  text = re.sub("theres", "there's", text)
  text = re.sub("dont", "don't", text)
  text = re.sub("whats", "what's", text)
  text = re.sub("[0-9]:[0-9]+\. ", "[0-9]:[0-9]+ \. ", text)
  text = re.sub("[a-z]\.[A-Z]", "[a-z]\. [A-Z]", text)
  text = re.sub("\t:[0-9]+", "\t: [0-9]+", text)
  tokens = word_tokenize(text)
#+END_SRC

这些正则表达式的意思大约是：加空格和加单引号。此处反斜杠多是用来让正则语义失效的，嗯~

* MultiWoz 2.2

最近，又出了新的一些MultiWoz数据集，2.2也算是其中之一。现整理如下：

#+BEGIN_SRC 
  .
  ├── convert_to_multiwoz_format.py
  ├── dev
  │   ├── dialogues_001.json
  │   └── dialogues_002.json
  ├── dialog_acts.json
  ├── README.md
  ├── requirements.txt
  ├── schema.json
  ├── test
  │   ├── dialogues_001.json
  │   └── dialogues_002.json
  └── train
      ├── dialogues_001.json
      ├── dialogues_002.json
#+END_SRC

透过这个文件树可以发现：data.json被划分成了三个数据集，同时也多了一个schema的东西。我们一步一步地去看。

