archives/multiwoz-reading.html



<div id="outline-container-orge359cc5" class="outline-3">
<h3 id="orge359cc5"><span class="section-number-3">3.3.</span> slot_descriptions与tokenization</h3>
<div class="outline-text-3" id="text-3-3">
<p>
这个数据集的另外一个特色是，除了上面的种种改动之外，MultiWoz2.1还添加了两个描述文件。
</p>

<ol class="org-ol">
<li>slot_descriptions.json 这个文件的用途和文件名一样，就是为了解释每一个slot是干什么用的。我怀疑这个文件可能是为了给当时的标注人员使用而创建</li>
<li>tokenization.md 这个文件主要是为了解决span_info中slot位置不准确的问题。我不是特别懂，总之，如果你想和DStC8的实验保持一致，那么你应该先保持先做一些变换，来尽可能地减小差距。代码如下：</li>
</ol>


<div class="org-src-container">
<pre class="src src-python"><span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"/"</span>, <span style="color: #e361c3;">" / "</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"\-"</span>, <span style="color: #e361c3;">" \- "</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"Im"</span>, <span style="color: #e361c3;">"I\'m"</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"im"</span>, <span style="color: #e361c3;">"i\'m"</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"theres"</span>, <span style="color: #e361c3;">"there's"</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"dont"</span>, <span style="color: #e361c3;">"don't"</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"whats"</span>, <span style="color: #e361c3;">"what's"</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"[0-9]:[0-9]+\. "</span>, <span style="color: #e361c3;">"[0-9]:[0-9]+ \. "</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"[a-z]\.[A-Z]"</span>, <span style="color: #e361c3;">"[a-z]\. [A-Z]"</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">text</span> = re.sub<span style="color: #a0586c;">(</span><span style="color: #e361c3;">"\t:[0-9]+"</span>, <span style="color: #e361c3;">"\t: [0-9]+"</span>, text<span style="color: #a0586c;">)</span>
<span style="color: #9587DD; background-color: #372E40;">tokens</span> = word_tokenize<span style="color: #a0586c;">(</span>text<span style="color: #a0586c;">)</span>
</pre>
</div>

<p>
这些正则表达式的意思大约是：加空格和加单引号。此处反斜杠多是用来让正则语义失效的，嗯~
</p>
</div>
</div>
</div>

<div id="outline-container-org2577299" class="outline-2">
<h2 id="org2577299"><span class="section-number-2">4.</span> MultiWoz 2.2</h2>
<div class="outline-text-2" id="text-4">
<p>
最近，又出了新的一些MultiWoz数据集，2.2也算是其中之一。现整理如下：
</p>

<pre class="example">
.
├── convert_to_multiwoz_format.py
├── dev
│   ├── dialogues_001.json
│   └── dialogues_002.json
├── dialog_acts.json
├── README.md
├── requirements.txt
├── schema.json
├── test
│   ├── dialogues_001.json
│   └── dialogues_002.json
└── train
    ├── dialogues_001.json
    ├── dialogues_002.json
</pre>

<p>
透过这个文件树可以发现：data.json被划分成了三个数据集，同时也多了一个schema的东西。我们一步一步地去看。
</p>
</div>
