DOCUMENTED_NOTES/multiwoz-reading.org
** schema：beyond ontology

   首先给出一个schema的例子，由于schema是按照对话领域进行组织的，所以一个例子就必然地包括一个领域。

   #+BEGIN_SRC js
      {
	 "service_name": "hotel",
	 "slots": [
	   {
	     "name": "hotel-pricerange",
	     "description": "price budget of the hotel",
	     "possible_values": [
	       "expensive",
	       "cheap",
	       "moderate"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-type",
	     "description": "what is the type of the hotel",
	     "possible_values": [
	       "guesthouse",
	       "hotel"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-parking",
	     "description": "whether the hotel has parking",
	     "possible_values": [
	       "free",
	       "no",
	       "yes"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-bookday",
	     "description": "day of the hotel booking",
	     "possible_values": [
	       "monday",
	       "tuesday",
	       "wednesday",
	       "thursday",
	       "friday",
	       "saturday",
	       "sunday"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-bookpeople",
	     "description": "number of people for the hotel booking",
	     "possible_values": [
	       "1",
	       "2",
	       "3",
	       "4",
	       "5",
	       "6",
	       "7",
	       "8"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-bookstay",
	     "description": "length of stay at the hotel",
	     "possible_values": [
	       "1",
	       "2",
	       "3",
	       "4",
	       "5",
	       "6",
	       "7",
	       "8"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-stars",
	     "description": "star rating of the hotel",
	     "possible_values": [
	       "0",
	       "1",
	       "2",
	       "3",
	       "4",
	       "5"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-internet",
	     "description": "whether the hotel has internet",
	     "possible_values": [
	       "free",
	       "no",
	       "yes"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-name",
	     "description": "name of the hotel",
	     "possible_values": [],
	     "is_categorical": false
	   },
	   {
	     "name": "hotel-area",
	     "description": "area or place of the hotel",
	     "possible_values": [
	       "centre",
	       "east",
	       "north",
	       "south",
	       "west"
	     ],
	     "is_categorical": true
	   },
	   {
	     "name": "hotel-address",
	     "description": "address of the hotel",
	     "is_categorical": false
	   },
	   {
	     "name": "hotel-phone",
	     "description": "phone number of the hotel",
	     "is_categorical": false
	   },
	   {
	     "name": "hotel-postcode",
	     "description": "postal code of the hotel",
	     "is_categorical": false
	   },
	   {
	     "name": "hotel-ref",
	     "description": "reference number of the hotel booking",
	     "is_categorical": false
	   }
	 ],
	 "description": "hotel reservations and vacation stays",
	 "intents": [
	   {
	     "name": "find_hotel",
	     "description": "search for a hotel to stay in",
	     "is_transactional": false,
	     "required_slots": [],
	     "optional_slots": {
	       "hotel-pricerange": "dontcare",
	       "hotel-type": "dontcare",
	       "hotel-parking": "dontcare",
	       "hotel-bookday": "dontcare",
	       "hotel-bookpeople": "dontcare",
	       "hotel-bookstay": "dontcare",
	       "hotel-stars": "dontcare",
	       "hotel-internet": "dontcare",
	       "hotel-name": "dontcare",
	       "hotel-area": "dontcare"
	     }
	   },
	   {
	     "name": "book_hotel",
	     "description": "book a hotel to stay in",
	     "is_transactional": true,
	     "required_slots": [],
	     "optional_slots": {
	       "hotel-pricerange": "dontcare",
	       "hotel-type": "dontcare",
	       "hotel-parking": "dontcare",
	       "hotel-bookday": "dontcare",
	       "hotel-bookpeople": "dontcare",
	       "hotel-bookstay": "dontcare",
	       "hotel-stars": "dontcare",
	       "hotel-internet": "dontcare",
	       "hotel-name": "dontcare",
	       "hotel-area": "dontcare"
	     }
	   }
	 ]
       },
   #+END_SRC

上述例子的一个具体结构如下：

#+BEGIN_SRC python
  |--service_name
      |--slots[]
	  |--slot i
	      |--name {domain-slot}
	      |--description
	      |--possible_values: [enum]
	      |--is_categorical: bool # denotes is enum type or not.
      |--description:str
      |--intents[]
	  |-- intent i
	      |--name {???}
	      |--description
	      |--is_transactional: bool # it means, if we need have a action, like running some function with this intents.
	      |--required_slots:[]
	      |--optional_slots:{}
		   |--slot i
		       |--value of slot i
#+END_SRC

   
可以看出，这种组织形式比之前好了一些，至少可以划分出哪些slot是枚举变量（categorical），以及哪些intent是要执行动作的（transactional）。这样的一个文件，可以说是把ontology表达的更详细了，且创造出来一种更加具有特定性的intent。


| Domain     | Categorical slots                                                               | Non-categorical slots                                                          | Intents    |
|------------+---------------------------------------------------------------------------------+--------------------------------------------------------------------------------+------------|
| Restaurant | pricerange, area, bookday, bookpeople                                           | food, name, booktime, address, phone, postcode, ref                            | find, book |
| Attraction | area, type                                                                      | name, address, entrancefee, openhours, entrancefee, openhours, phone, postcode | find       |
| Hotel      | pricerange, parking, internet, stars, area, type, bookpeople, bookday, bookstay | name, address, phone, postcode, ref                                            | find, book |
| Taxi       | -                                                                               | destination, departure, arriveby, leaveat, phone, type                         | book       |
| Train      | destination, departure, day, bookpeople                                         | arriveby, leaveat, trainid, ref, price, duration                               | find, book |
| Bus        | day                                                                             | departure, destination, leaveat                                                | find       |
| Hospital   | -                                                                               | department , address, phone, postcode                                          | find       |
| Police     | -                                                                               | name, address, phone, postcode                                                 | find       |

