archives/multiwoz-reading.html

<div id="outline-container-orgd862c99" class="outline-3">
<h3 id="orgd862c99"><span class="section-number-3">4.1.</span> schema：beyond ontology</h3>
<div class="outline-text-3" id="text-4-1">
<p>
首先给出一个schema的例子，由于schema是按照对话领域进行组织的，所以一个例子就必然地包括一个领域。
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #a0586c;">{</span>
   <span style="color: #e361c3;">"service_name"</span>: <span style="color: #e361c3;">"hotel"</span>,
   <span style="color: #e361c3;">"slots"</span>: <span style="color: #9d81ba;">[</span>
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-pricerange"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"price budget of the hotel"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"expensive"</span>,
         <span style="color: #e361c3;">"cheap"</span>,
         <span style="color: #e361c3;">"moderate"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-type"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"what is the type of the hotel"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"guesthouse"</span>,
         <span style="color: #e361c3;">"hotel"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-parking"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"whether the hotel has parking"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"free"</span>,
         <span style="color: #e361c3;">"no"</span>,
         <span style="color: #e361c3;">"yes"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-bookday"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"day of the hotel booking"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"monday"</span>,
         <span style="color: #e361c3;">"tuesday"</span>,
         <span style="color: #e361c3;">"wednesday"</span>,
         <span style="color: #e361c3;">"thursday"</span>,
         <span style="color: #e361c3;">"friday"</span>,
         <span style="color: #e361c3;">"saturday"</span>,
         <span style="color: #e361c3;">"sunday"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-bookpeople"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"number of people for the hotel booking"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"1"</span>,
         <span style="color: #e361c3;">"2"</span>,
         <span style="color: #e361c3;">"3"</span>,
         <span style="color: #e361c3;">"4"</span>,
         <span style="color: #e361c3;">"5"</span>,
         <span style="color: #e361c3;">"6"</span>,
         <span style="color: #e361c3;">"7"</span>,
         <span style="color: #e361c3;">"8"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-bookstay"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"length of stay at the hotel"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"1"</span>,
         <span style="color: #e361c3;">"2"</span>,
         <span style="color: #e361c3;">"3"</span>,
         <span style="color: #e361c3;">"4"</span>,
         <span style="color: #e361c3;">"5"</span>,
         <span style="color: #e361c3;">"6"</span>,
         <span style="color: #e361c3;">"7"</span>,
         <span style="color: #e361c3;">"8"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-stars"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"star rating of the hotel"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"0"</span>,
         <span style="color: #e361c3;">"1"</span>,
         <span style="color: #e361c3;">"2"</span>,
         <span style="color: #e361c3;">"3"</span>,
         <span style="color: #e361c3;">"4"</span>,
         <span style="color: #e361c3;">"5"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-internet"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"whether the hotel has internet"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"free"</span>,
         <span style="color: #e361c3;">"no"</span>,
         <span style="color: #e361c3;">"yes"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-name"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"name of the hotel"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">false</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-area"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"area or place of the hotel"</span>,
       <span style="color: #e361c3;">"possible_values"</span>: <span style="color: #C68EDE;">[</span>
         <span style="color: #e361c3;">"centre"</span>,
         <span style="color: #e361c3;">"east"</span>,
         <span style="color: #e361c3;">"north"</span>,
         <span style="color: #e361c3;">"south"</span>,
         <span style="color: #e361c3;">"west"</span>
       <span style="color: #C68EDE;">]</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">true</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-address"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"address of the hotel"</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">false</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-phone"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"phone number of the hotel"</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">false</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-postcode"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"postal code of the hotel"</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">false</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"hotel-ref"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"reference number of the hotel booking"</span>,
       <span style="color: #e361c3;">"is_categorical"</span>: <span style="color: #738FD7;">false</span>
     <span style="color: #9587DD;">}</span>
   <span style="color: #9d81ba;">]</span>,
   <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"hotel reservations and vacation stays"</span>,
   <span style="color: #e361c3;">"intents"</span>: <span style="color: #9d81ba;">[</span>
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"find_hotel"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"search for a hotel to stay in"</span>,
       <span style="color: #e361c3;">"is_transactional"</span>: <span style="color: #738FD7;">false</span>,
       <span style="color: #e361c3;">"required_slots"</span>: <span style="color: #C68EDE;">[]</span>,
       <span style="color: #e361c3;">"optional_slots"</span>: <span style="color: #C68EDE;">{</span>
         <span style="color: #e361c3;">"hotel-pricerange"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-type"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-parking"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-bookday"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-bookpeople"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-bookstay"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-stars"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-internet"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-name"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-area"</span>: <span style="color: #e361c3;">"dontcare"</span>
       <span style="color: #C68EDE;">}</span>
     <span style="color: #9587DD;">}</span>,
     <span style="color: #9587DD;">{</span>
       <span style="color: #e361c3;">"name"</span>: <span style="color: #e361c3;">"book_hotel"</span>,
       <span style="color: #e361c3;">"description"</span>: <span style="color: #e361c3;">"book a hotel to stay in"</span>,
       <span style="color: #e361c3;">"is_transactional"</span>: <span style="color: #738FD7;">true</span>,
       <span style="color: #e361c3;">"required_slots"</span>: <span style="color: #C68EDE;">[]</span>,
       <span style="color: #e361c3;">"optional_slots"</span>: <span style="color: #C68EDE;">{</span>
         <span style="color: #e361c3;">"hotel-pricerange"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-type"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-parking"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-bookday"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-bookpeople"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-bookstay"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-stars"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-internet"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-name"</span>: <span style="color: #e361c3;">"dontcare"</span>,
         <span style="color: #e361c3;">"hotel-area"</span>: <span style="color: #e361c3;">"dontcare"</span>
       <span style="color: #C68EDE;">}</span>
     <span style="color: #9587DD;">}</span>
   <span style="color: #9d81ba;">]</span>
 <span style="color: #a0586c;">}</span>,
</pre>
</div>

<p>
上述例子的一个具体结构如下：
</p>

<div class="org-src-container">
<pre class="src src-python">|--service_name
    |--slots<span style="color: #a0586c;">[]</span>
        |--slot i
            |--name <span style="color: #a0586c;">{</span>domain-slot<span style="color: #a0586c;">}</span>
            |--description
            |--possible_values: <span style="color: #a0586c;">[</span>enum<span style="color: #a0586c;">]</span>
            |--is_categorical: <span style="color: #fbaed2;">bool</span> <span style="color: #7A6884;"># </span><span style="color: #7A6884; font-style: italic;">denotes is enum type or not.</span>
    |--description:<span style="color: #fbaed2;">str</span>
    |--intents<span style="color: #a0586c;">[]</span>
        |-- intent i
            |--name <span style="color: #a0586c;">{</span>???<span style="color: #a0586c;">}</span>
            |--description
            |--is_transactional: <span style="color: #fbaed2;">bool</span> <span style="color: #7A6884;"># </span><span style="color: #7A6884; font-style: italic;">it means, if we need have a action, like running some function with this intents.</span>
            |--required_slots:<span style="color: #a0586c;">[]</span>
            |--optional_slots:<span style="color: #a0586c;">{}</span>
                 |--slot i
                     |--value of slot i
</pre>
</div>


<p>
可以看出，这种组织形式比之前好了一些，至少可以划分出哪些slot是枚举变量（categorical），以及哪些intent是要执行动作的（transactional）。这样的一个文件，可以说是把ontology表达的更详细了，且创造出来一种更加具有特定性的intent。
</p>


<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Domain</th>
<th scope="col" class="org-left">Categorical slots</th>
<th scope="col" class="org-left">Non-categorical slots</th>
<th scope="col" class="org-left">Intents</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Restaurant</td>
<td class="org-left">pricerange, area, bookday, bookpeople</td>
<td class="org-left">food, name, booktime, address, phone, postcode, ref</td>
<td class="org-left">find, book</td>
</tr>

<tr>
<td class="org-left">Attraction</td>
<td class="org-left">area, type</td>
<td class="org-left">name, address, entrancefee, openhours, entrancefee, openhours, phone, postcode</td>
<td class="org-left">find</td>
</tr>

<tr>
<td class="org-left">Hotel</td>
<td class="org-left">pricerange, parking, internet, stars, area, type, bookpeople, bookday, bookstay</td>
<td class="org-left">name, address, phone, postcode, ref</td>
<td class="org-left">find, book</td>
</tr>

<tr>
<td class="org-left">Taxi</td>
<td class="org-left">-</td>
<td class="org-left">destination, departure, arriveby, leaveat, phone, type</td>
<td class="org-left">book</td>
</tr>

<tr>
<td class="org-left">Train</td>
<td class="org-left">destination, departure, day, bookpeople</td>
<td class="org-left">arriveby, leaveat, trainid, ref, price, duration</td>
<td class="org-left">find, book</td>
</tr>

<tr>
<td class="org-left">Bus</td>
<td class="org-left">day</td>
<td class="org-left">departure, destination, leaveat</td>
<td class="org-left">find</td>
</tr>

<tr>
<td class="org-left">Hospital</td>
<td class="org-left">-</td>
<td class="org-left">department , address, phone, postcode</td>
<td class="org-left">find</td>
</tr>

<tr>
<td class="org-left">Police</td>
<td class="org-left">-</td>
<td class="org-left">name, address, phone, postcode</td>
<td class="org-left">find</td>
</tr>
</tbody>
</table>
</div>
</div>
