DOCUMENTED_NOTES/multiwoz-reading.org
** 对话数据格式的改变

先来看一条数据：

#+BEGIN_SRC emacs-lisp
    {
      "dialogue_id": "PMUL4398.json",
      "services": [
	"restaurant",
	"hotel"
      ],
      "turns": [
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "restaurant",
	      "slots": [],
	      "state": {
		"active_intent": "find_restaurant",
		"requested_slots": [],
		"slot_values": {
		  "restaurant-area": [
		    "centre"
		  ],
		  "restaurant-pricerange": [
		    "expensive"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "taxi",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "train",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "bus",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "police",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hotel",
	      "slots": [],
	      "state": {
		"active_intent": "find_hotel",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "attraction",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hospital",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    }
	  ],
	  "speaker": "USER",
	  "turn_id": "0",
	  "utterance": "i need a place to dine in the center thats expensive"
	},
	{
	  "frames": [],
	  "speaker": "SYSTEM",
	  "turn_id": "1",
	  "utterance": "I have several options for you; do you prefer African, Asian, or British food?"
	},
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "restaurant",
	      "slots": [],
	      "state": {
		"active_intent": "find_restaurant",
		"requested_slots": [
		  "restaurant-food"
		],
		"slot_values": {
		  "restaurant-area": [
		    "centre"
		  ],
		  "restaurant-pricerange": [
		    "expensive"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "taxi",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "train",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "bus",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "police",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hotel",
	      "slots": [],
	      "state": {
		"active_intent": "find_hotel",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "attraction",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hospital",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    }
	  ],
	  "speaker": "USER",
	  "turn_id": "2",
	  "utterance": "Any sort of food would be fine, as long as it is a bit expensive. Could I get the phone number for your recommendation?"
	},
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "restaurant",
	      "slots": [
		{
		  "exclusive_end": 38,
		  "slot": "restaurant-name",
		  "start": 31,
		  "value": "Bedouin"
		}
	      ]
	    }
	  ],
	  "speaker": "SYSTEM",
	  "turn_id": "3",
	  "utterance": "There is an Afrian place named Bedouin in the centre. How does that sound?"
	},
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "restaurant",
	      "slots": [],
	      "state": {
		"active_intent": "find_restaurant",
		"requested_slots": [
		  "restaurant-phone"
		],
		"slot_values": {
		  "restaurant-area": [
		    "centre"
		  ],
		  "restaurant-name": [
		    "bedouin"
		  ],
		  "restaurant-pricerange": [
		    "expensive"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hotel",
	      "slots": [],
	      "state": {
		"active_intent": "find_hotel",
		"requested_slots": [],
		"slot_values": {
		  "hotel-pricerange": [
		    "expensive"
		  ],
		  "hotel-type": [
		    "hotel"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "taxi",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "train",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "bus",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "police",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "attraction",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hospital",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    }
	  ],
	  "speaker": "USER",
	  "turn_id": "4",
	  "utterance": "Sounds good, could I get that phone number? Also, could you recommend me an expensive hotel?"
	},
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "hotel",
	      "slots": [
		{
		  "exclusive_end": 90,
		  "slot": "hotel-name",
		  "start": 69,
		  "value": "University Arms Hotel"
		}
	      ]
	    }
	  ],
	  "speaker": "SYSTEM",
	  "turn_id": "5",
	  "utterance": "Bedouin's phone is 01223367660. As far as hotels go, I recommend the University Arms Hotel in the center of town."
	},
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "restaurant",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {
		  "restaurant-area": [
		    "centre"
		  ],
		  "restaurant-name": [
		    "bedouin"
		  ],
		  "restaurant-pricerange": [
		    "expensive"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hotel",
	      "slots": [],
	      "state": {
		"active_intent": "find_hotel",
		"requested_slots": [],
		"slot_values": {
		  "hotel-name": [
		    "university arms hotel"
		  ],
		  "hotel-pricerange": [
		    "expensive"
		  ],
		  "hotel-type": [
		    "hotel"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "taxi",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "train",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "bus",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "police",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "attraction",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hospital",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    }
	  ],
	  "speaker": "USER",
	  "turn_id": "6",
	  "utterance": "Yes. Can you book it for me?"
	},
	{
	  "frames": [],
	  "speaker": "SYSTEM",
	  "turn_id": "7",
	  "utterance": "Sure, when would you like that reservation?"
	},
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "restaurant",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {
		  "restaurant-area": [
		    "centre"
		  ],
		  "restaurant-name": [
		    "bedouin"
		  ],
		  "restaurant-pricerange": [
		    "expensive"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hotel",
	      "slots": [],
	      "state": {
		"active_intent": "book_hotel",
		"requested_slots": [],
		"slot_values": {
		  "hotel-bookday": [
		    "saturday"
		  ],
		  "hotel-bookpeople": [
		    "2"
		  ],
		  "hotel-bookstay": [
		    "2"
		  ],
		  "hotel-name": [
		    "university arms hotel"
		  ],
		  "hotel-pricerange": [
		    "expensive"
		  ],
		  "hotel-type": [
		    "hotel"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "taxi",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "train",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "bus",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "police",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "attraction",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hospital",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    }
	  ],
	  "speaker": "USER",
	  "turn_id": "8",
	  "utterance": "i want to book it for 2 people and 2 nights starting from saturday."
	},
	{
	  "frames": [],
	  "speaker": "SYSTEM",
	  "turn_id": "9",
	  "utterance": "Your booking was successful. Your reference number is FRGZWQL2 . May I help you further?"
	},
	{
	  "frames": [
	    {
	      "actions": [],
	      "service": "restaurant",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {
		  "restaurant-area": [
		    "centre"
		  ],
		  "restaurant-name": [
		    "bedouin"
		  ],
		  "restaurant-pricerange": [
		    "expensive"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hotel",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {
		  "hotel-bookday": [
		    "saturday"
		  ],
		  "hotel-bookpeople": [
		    "2"
		  ],
		  "hotel-bookstay": [
		    "2"
		  ],
		  "hotel-name": [
		    "university arms hotel"
		  ],
		  "hotel-pricerange": [
		    "expensive"
		  ],
		  "hotel-type": [
		    "hotel"
		  ]
		}
	      }
	    },
	    {
	      "actions": [],
	      "service": "taxi",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "train",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "bus",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "police",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "attraction",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    },
	    {
	      "actions": [],
	      "service": "hospital",
	      "slots": [],
	      "state": {
		"active_intent": "NONE",
		"requested_slots": [],
		"slot_values": {}
	      }
	    }
	  ],
	  "speaker": "USER",
	  "turn_id": "10",
	  "utterance": "That is all I need to know. Thanks, good bye."
	},
	{
	  "frames": [],
	  "speaker": "SYSTEM",
	  "turn_id": "11",
	  "utterance": "Thank you so much for Cambridge TownInfo centre. Have a great day!"
	}
      ]
    },
#+END_SRC

上述代码的结构如下图所示：

#+BEGIN_SRC python
  |--dialogue_id
  |--services[]
      |--domain 1
      |--domain i
  |--turns
      |--frames[]
	      |--actions
	      |--services
	      |--slots[]
		  |--exclusive_end
		  |--slot
		  |--start
                  |value
	      |--state
		  |--active_intent
		  |--requested_slots
		  |--slot_values
		      |--domain-slot i
			  |--value i
      |--speaker
      |--turn_id
      |--utterance
#+END_SRC

可以看出，2.2的格式与以往大不相同！该对话语料重新定义了turn，即一个角色的一句话，就是一个turn。除此以外，我们可以发现，2.2的标注更加细化了，比如对于每一句话，其speaker也被包含进来。actions我一直看着都是0，奇怪。service就是domain，不提。slots常常会包含一些结果，不过我不理解其具体含义，比如start和end，理论上讲也应该是slot所出现的位置，但是这和目标需求，都是不对应的。甚至在slots里所列举的slot，也是语句里没有出现的。这是为什么？难道2.2的标注不仅没有改对，反而更错了？

当然不是！我们可以观察到另外一个现象：虽然一个角色的一句话被看作是1个turn，但是2.2却是以user-system这样的一个pair进行一次标注，换而言之，由于system角色对应的frames全部都是空的，不是因为他们没有所需要的标注信息，而是因为：他们的信息被放在了和user一起的frames里面。如果把system和user的话放在一起，这样去数位置的话，start对应的位置就正常了。

state都是挺全面的，就是belief state。并且active_intent也把需要的结果展示出来了。




