archives/multiwoz-reading.html

<div id="outline-container-org484bb92" class="outline-3">
<h3 id="org484bb92"><span class="section-number-3">4.2.</span> 对话数据格式的改变</h3>
<div class="outline-text-3" id="text-4-2">
<p>
先来看一条数据：
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">{
  <span style="color: #e361c3;">"dialogue_id"</span>: <span style="color: #e361c3;">"PMUL4398.json"</span>,
  <span style="color: #e361c3;">"services"</span>: <span style="color: #a0586c;">[</span>
    <span style="color: #e361c3;">"restaurant"</span>,
    <span style="color: #e361c3;">"hotel"</span>
  <span style="color: #a0586c;">]</span><span style="color: #f3c91f;">,</span>
  <span style="color: #e361c3;">"turns"</span>: <span style="color: #a0586c;">[</span>
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"restaurant"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"find_restaurant"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"restaurant-area"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"centre"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"taxi"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"train"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"bus"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"police"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hotel"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"find_hotel"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"attraction"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hospital"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"USER"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"0"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"i need a place to dine in the center thats expensive"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[]</span>,
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"SYSTEM"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"1"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"I have several options for you; do you prefer African, Asian, or British food?"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"restaurant"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"find_restaurant"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[</span>
              <span style="color: #e361c3;">"restaurant-food"</span>
            <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"restaurant-area"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"centre"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"taxi"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"train"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"bus"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"police"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hotel"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"find_hotel"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"attraction"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hospital"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"USER"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"2"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"Any sort of food would be fine, as long as it is a bit expensive. Could I get the phone number for your recommendation?"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"restaurant"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[</span>
            {
              <span style="color: #e361c3;">"exclusive_end"</span>: 38,
              <span style="color: #e361c3;">"slot"</span>: <span style="color: #e361c3;">"restaurant-name"</span>,
              <span style="color: #e361c3;">"start"</span>: 31,
              <span style="color: #e361c3;">"value"</span>: <span style="color: #e361c3;">"Bedouin"</span>
            }
          <span style="color: #9587DD;">]</span>
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"SYSTEM"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"3"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"There is an Afrian place named Bedouin in the centre. How does that sound?"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"restaurant"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"find_restaurant"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[</span>
              <span style="color: #e361c3;">"restaurant-phone"</span>
            <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"restaurant-area"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"centre"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-name"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"bedouin"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hotel"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"find_hotel"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"hotel-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-type"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"hotel"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"taxi"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"train"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"bus"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"police"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"attraction"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hospital"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"USER"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"4"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"Sounds good, could I get that phone number? Also, could you recommend me an expensive hotel?"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hotel"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[</span>
            {
              <span style="color: #e361c3;">"exclusive_end"</span>: 90,
              <span style="color: #e361c3;">"slot"</span>: <span style="color: #e361c3;">"hotel-name"</span>,
              <span style="color: #e361c3;">"start"</span>: 69,
              <span style="color: #e361c3;">"value"</span>: <span style="color: #e361c3;">"University Arms Hotel"</span>
            }
          <span style="color: #9587DD;">]</span>
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"SYSTEM"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"5"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"Bedouin's phone is 01223367660. As far as hotels go, I recommend the University Arms Hotel in the center of town."</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"restaurant"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"restaurant-area"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"centre"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-name"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"bedouin"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hotel"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"find_hotel"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"hotel-name"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"university arms hotel"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-type"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"hotel"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"taxi"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"train"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"bus"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"police"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"attraction"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hospital"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"USER"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"6"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"Yes. Can you book it for me?"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[]</span>,
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"SYSTEM"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"7"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"Sure, when would you like that reservation?"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"restaurant"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"restaurant-area"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"centre"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-name"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"bedouin"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hotel"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"book_hotel"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"hotel-bookday"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"saturday"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-bookpeople"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"2"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-bookstay"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"2"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-name"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"university arms hotel"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-type"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"hotel"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"taxi"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"train"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"bus"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"police"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"attraction"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hospital"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"USER"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"8"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"i want to book it for 2 people and 2 nights starting from saturday."</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[]</span>,
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"SYSTEM"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"9"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"Your booking was successful. Your reference number is FRGZWQL2 . May I help you further?"</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[</span>
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"restaurant"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"restaurant-area"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"centre"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-name"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"bedouin"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"restaurant-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hotel"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {
              <span style="color: #e361c3;">"hotel-bookday"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"saturday"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-bookpeople"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"2"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-bookstay"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"2"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-name"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"university arms hotel"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-pricerange"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"expensive"</span>
              <span style="color: #9587DD;">]</span><span style="color: #f3c91f;">,</span>
              <span style="color: #e361c3;">"hotel-type"</span>: <span style="color: #9587DD;">[</span>
                <span style="color: #e361c3;">"hotel"</span>
              <span style="color: #9587DD;">]</span>
            }
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"taxi"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"train"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"bus"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"police"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"attraction"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        },
        {
          <span style="color: #e361c3;">"actions"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"service"</span>: <span style="color: #e361c3;">"hospital"</span>,
          <span style="color: #e361c3;">"slots"</span>: <span style="color: #9587DD;">[]</span>,
          <span style="color: #e361c3;">"state"</span>: {
            <span style="color: #e361c3;">"active_intent"</span>: <span style="color: #e361c3;">"NONE"</span>,
            <span style="color: #e361c3;">"requested_slots"</span>: <span style="color: #9587DD;">[]</span>,
            <span style="color: #e361c3;">"slot_values"</span>: {}
          }
        }
      <span style="color: #9d81ba;">]</span><span style="color: #f3c91f;">,</span>
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"USER"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"10"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"That is all I need to know. Thanks, good bye."</span>
    },
    {
      <span style="color: #e361c3;">"frames"</span>: <span style="color: #9d81ba;">[]</span>,
      <span style="color: #e361c3;">"speaker"</span>: <span style="color: #e361c3;">"SYSTEM"</span>,
      <span style="color: #e361c3;">"turn_id"</span>: <span style="color: #e361c3;">"11"</span>,
      <span style="color: #e361c3;">"utterance"</span>: <span style="color: #e361c3;">"Thank you so much for Cambridge TownInfo centre. Have a great day!"</span>
    }
  <span style="color: #a0586c;">]</span>
},
</pre>
</div>

<p>
上述代码的结构如下图所示：
</p>

<div class="org-src-container">
<pre class="src src-python">|--dialogue_id
|--services<span style="color: #a0586c;">[]</span>
    |--domain 1
    |--domain i
|--turns
    |--frames<span style="color: #a0586c;">[]</span>
            |--actions
            |--services
            |--slots<span style="color: #a0586c;">[]</span>
                |--exclusive_end
                |--slot
                |--start
                |value
            |--state
                |--active_intent
                |--requested_slots
                |--slot_values
                    |--domain-slot i
                        |--value i
    |--speaker
    |--turn_id
    |--utterance
</pre>
</div>

<p>
可以看出，2.2的格式与以往大不相同！该对话语料重新定义了turn，即一个角色的一句话，就是一个turn。除此以外，我们可以发现，2.2的标注更加细化了，比如对于每一句话，其speaker也被包含进来。actions我一直看着都是0，奇怪。service就是domain，不提。slots常常会包含一些结果，不过我不理解其具体含义，比如start和end，理论上讲也应该是slot所出现的位置，但是这和目标需求，都是不对应的。甚至在slots里所列举的slot，也是语句里没有出现的。这是为什么？难道2.2的标注不仅没有改对，反而更错了？
</p>

<p>
当然不是！我们可以观察到另外一个现象：虽然一个角色的一句话被看作是1个turn，但是2.2却是以user-system这样的一个pair进行一次标注，换而言之，由于system角色对应的frames全部都是空的，不是因为他们没有所需要的标注信息，而是因为：他们的信息被放在了和user一起的frames里面。如果把system和user的话放在一起，这样去数位置的话，start对应的位置就正常了。
</p>

<p>
state都是挺全面的，就是belief state。并且active_intent也把需要的结果展示出来了。
</p>
</div>
</div>
</div>
